# include "TXLib.h"

# include "NurievaSDK\NurievaLib.h"

void SCENEONE();
void SCENETWO();
void SCENETHREE();
void start();
void ending();
void SCENEFOUR();
void SCENEFIVE();

int main()
        {
        txCreateWindow(1600, 900);
        txSetFillColor(TX_WHITE);
        txRectangle(0, 0, 1600, 900);
        txPlaySound("ms.wav");
        start();
        SCENEONE();
        SCENETWO();
        SCENETHREE();
        SCENEFOUR();
        SCENEFIVE();
        ending();
        txSleep(20000);
        txSetFillColor(RGB(255, 255, 255));
        txClear();
        return 0;
        }
//==============================НАЧАЛО========================================================================
void start()
          {
          txSetFillColor (TX_LIGHTGREEN);
          txRectangle(0, 0, 1600, 900);
          txSetColor(RGB(0, 0, 0));
          txSelectFont("Comic Sans MS", 60);
          txTextOut(400, 450, "МУЛЬТИК *ВОЛШЕБНАЯ ШАПОЧКА*");
          txSleep(2000);
          }
//==========================СЦЕНА ПЕРВАЯ======================================================================
void SCENEONE()
             {
             int dk = 0;
             while (-200 + 25*dk < 350)
                   {
                   FonSc1(dk);
                   Bat(890, 140, 2, 2);
                   Man(-200 + 25*dk, 450, 3, 3, -100, 1, 1, 1, 0, 0 + 25 - 25*(dk % 2));
                   Fun("Ничего не радует, вот бы снова улыбаться, - говорит мальчик.");
                   dk ++;
                   }
             FunScOne1("Не расстраивайся, я тебе помогу, - сказала сидевшая на вершине дерева летучая мышь.", 0);
             FunScOne1("Выручи кого-нибудь, твоя шапка замигает, и ты вернёшь улыбку, - произнесла она.", 0);
             dk = 0;
             while (890 - 20*dk > -150)
                   {
                   FonSc1(dk);
                   Man(350, 450, 3, 3, -100, 1, 1, 1, 0, 30);
                   Bat(890 - 20*dk, (140 + 0 + 25 - 25*(dk%2)), 2, 0 + 25 - 25*(dk % 2));
                   Fun("Странно это всё, но я попробую, - промолвил мальчик.");
                   dk ++;
                   }
             }
//==========================СЦЕНА ВТОРАЯ================================================
void SCENETWO()
             {
             int dk = 0;
             while (-50 + 20*dk < 482)
                   {
                   FonSc234(dk);
                   mouse(-50 + 20*dk, 850, 1, 2, 4, (dk%2));
                   Fun("Помогите, убивают, - кричал выбежавший зверёк.");
                   dk ++;
                   }
             dk = 0;
             while (482 + 20*dk < 1120)
                   {
                   FonSc234(dk);
                   mouse(482 + 20*dk, 850 - 6*dk, 1, 2, 4, (dk%2));
                   stone(555, 310, 2);
                   Fun("Мышка, я тебе помогу. Спрячься за тот камень, - сказал мальчик.");
                   dk ++;
                   }
             }
//=======================СЦЕНА ТРЕТЬЯ===================================================
void SCENETHREE()
               {
               int dk = 0;
               while (-50 + 20*dk < 600)
                     {
                     FonSc234(dk);
                     cat(-50 + 20*dk, 800, 2, 2, 1, (dk%2));
                     dk ++;
                     Fun("Мяу, мяу, мяу, - издавалось откуда-то.");
                     }
               FunScThree("Мальчик, ты не видел мышку, - спросил котик.", 0);
               FunScThree("Нет, не видел, - ответил мальчик.", 0);
               dk = 0;
               while (600 + 30*dk < 2000)
                     {
                     FonSc234(dk);
                     cat(600 + 30*dk, 800, 2, 2, 1, (dk%2));
                     dk ++;
                     Fun("Эх, жаль, - произнесло животное.");
                    }
               }
//==========================СЦЕНА ЧЕТЫРЕ================================================
void SCENEFOUR()
              {
              int dk = 0;
              while (660 + 20*dk < 850)
                    {
                    FonSc234(dk);
                    mouse(1120, 660 + 20*dk, 1, 2, 4, (dk%2));
                    stone(555, 310, 2);
                    dk ++;
                    Fun("");
                    }
              dk = 0;
              while (1120 + 20*dk < 1800)
                    {
                    FonSc234(dk);
                    mouse(1120 + 20*dk, 850, 1, 2, 4, (dk%2));
                    dk ++;
                    Fun("Спасибо тебе! Я очень благодарна, ты спас меня, - сказала мышка.");
                    }
              dk = 0;
              while (300 + 20*dk < 1800)
                    {
                    FonSc4(dk);
                    Man(300 + 25*dk, 450, 3, 3, 0 + 25 - 25*(dk % 2), 1 + 20*dk, 1 + 30*dk, 1 + 40*dk, 0 + 0.2*dk, 0 + 25 - 25*(dk % 2));
                    dk ++;
                    Fun("Ура, получилось!!! - кричал мальчик.");
                    }
              }
//=======================СЦЕНА ПЯТАЯ===================================================
void SCENEFIVE()
              {
              int dk = 0;
              while (-100 + 20*dk < 900)
                    {
                    FonSc5(dk);
                    Man(-100 + 20*dk, 450, 3, 3, -100, 1 + 20*dk , 1 + 30*dk, 1 + 40*dk, 10, 0 + 25 - 25*(dk % 2));
                    dk ++;
                    Fun("");
                    }
              dk = 0;
              while (-100 + 20*dk < 990)
                    {
                    FonSc5(dk);
                    Bat(-100 + 20*dk, (140 + 0 + 25 - 25*(dk%2)), 2, 0 + 25 - 25*(dk % 2));
                    Man(900, 450, 3, 3, -100, 1 + 20*dk , 1 + 30*dk, 1 + 40*dk, 10, 30);
                    dk ++;
                    Fun("Понравилось ли тебе делать кого-то другого счастливым, - спросила мышка.");
                    }
              dk = 0;
              while (1 + 20*dk < 200)
                    {
                    FonSc5(dk);
                    Bat(990, 200, 2, 0 + 25 - 25*(dk % 2));
                    Man(900, 450, 3, 3, -100, 1 + 20*dk , 1 + 30*dk, 1 + 40*dk, 10, 30);
                    dk ++;
                    Fun("Да, от этого стало теплее на душе, - ответил ей мальчик.");
                    }
              dk = 0;
              while (100 + 20*dk < 400)
                    {
                    FonSc5(dk);
                    Bat(990, 200, 2, 0 + 25 - 25*(dk % 2));
                    Man(900, 450, 3, 3, -100, 100 + 20*dk , 1 + 30*dk, 1 + 40*dk, 10, 30);
                    dk ++;
                    Fun("Это простая шапка. От улыбок других и сам начинаешь улыбаться, - раскрыл секрет зверёк.");
                    }
              dk = 0;
              while (200 + 20*dk < 800)
                    {
                    FonSc5(dk);
                    Bat(990, 200, 2, 0 + 25 - 25*(dk % 2));
                    Man(900, 450, 3, 3, -100, 200 + 20*dk , 1 + 30*dk, 1 + 40*dk, 10, 30);
                    dk ++;
                    Fun("Ничего себе, а ведь и правда!");
                    }
}
//================================КОНЕЦ===========================================
void ending()
           {
           txSetFillColor (TX_LIGHTGREEN);
           txRectangle(0, 0, 1600, 900);
           txSetColor(RGB(0, 0, 0));
           txSelectFont("Comic Sans MS", 60);
           txTextOut(800, 450, "КОНЕЦ");
           txSleep(2000);
           }

